[
  {
    "name": "Wei Qiu, Ph.D.",
    "headshotFile": "https://www.weber.edu/wsuimages/chfam/chfdepart/images/faculty/WeiQiucrop.jpg",
    "vitae": "",
    "webpage": "/individual_pages/qiu.html",
    "office": "ED Building 205",
    "email": "weiqiu@weber.edu",
    "phone": 8016267386,
    "education": [
      "Ph.D. Human Development and Family Studies, University of Delaware",
      "M.S. Human Development and Family Studies, University of Delaware",
      "M.A. English, Nanjing University",
      "B.A. English, Nanjing University"
    ],
    "courses": [
      {
        "identifier": "ECED 2610 ",
        "name": "Child Guidance",
        "description": "This course focuses on the understanding and use of developmentally, culturally, and linguistically appropriate guidance practices to make evidence-based, data-informed decisions that support each child. Students complete a minimum of 24 hours of field experience observing and practicing in an early learning setting serving diverse populations of children 0-8 years."
      },
      {
        "identifier": "ECED 4990",
        "name": "Seminar in Early Childhood Education",
        "description": "This is an Early Childhood Education capstone course in which students synthesize and demonstrate learning outcomes expected for all ECE professional standards and competencies."
      },
      {
        "identifier": "ECED 4230/GSE 6230",
        "name": "Observing and Assessing Children in Context",
        "description": "This course provides students with knowledge and skills to use observation, documentation, and assessment tools to inform instruction, planning, and intervention programs for young children birth through eight years. Special attention is given to contextualized assessment practices that are responsive to children's strengths, needs, cultures, races, languages, and family experiences."
      }
    ],
    "awards": [],
    "articles": [
      "Zhang, C., Qiu, W., Li, H., Li, J., Zhang, L., Li, X., & Li, J. (2021). Parental stress and home activities for young children during the stay-at-home quarantine time in China. Early Education and Development, 32(6), 843-862. https://doi.org/10.1080/10409289.2021.1949561",
      "Zhang, C., & Qiu, W. (2020). Impact of the COVID-19 pandemic on parental stress and young children’s development during physical distancing. Natural Hazards Center Quick Response Grant Report Series, 312. Boulder, CO: Natural Hazards Center, University of Colorado Boulder. https://hazards.colorado.edu/quick-response-report/impact-of-the-covid-19-pandemic-on-parental-stress-and-young-childrens-development-during-physical-distancing"
    ]
  },
  {
    "name": "Sheila Anderson, PH.D.",
    "headshotFile": "https://www.weber.edu/wsuimages/chfam/chfdepart/images/faculty/SheilaAnderson_9723-2.jpg",
    "vitae": "./vitae/2022 CURRICULUM_VITAE_Sheila_Anderson.docx",
    "webpage": "/individual_pages/anderson.html",
    "office": "ED Building Room 206",
    "office_hours": [],
    "email": "sanderson@weber.edu",
    "phone": 8019174530,
    "education": [
      "Ph.D. Family &amp; Human Development, Early Childhood Emphasis, Utah State University",
      "M.Ed. Education Curriculum &amp; Instruction, EC Emphasis, Weber State University",
      "B.S. Psychology and Human Development, University of Utah",
      "A.A.S. Child Development, Southern Utah University"
    ],
    "courses": [
      {
        "identifier": "CHF 2500",
        "name": "Understanding Child Development"
      },
      {
        "identifier": "CHF 2600",
        "name": "Introduction to Early Childhood Development"
      },
      {
        "identifier": "CHF 4730",
        "name": "Early Childhood Education Development Program"
      }
    ],
    "grants": [
      "Northern Utah United Way (June 2020-May 2021, $23,000).Welcome Baby Curriculum Revisions. This project included revisions to a home visiting curriculum to update content and integrate a facilitative interpersonal interaction approach. The project coordinated collaborators from the WSU Nursing and Spanish department, graphic design and University of Utah developmental psychology.",
      "Office of Child Care High Quality School Readiness. (Aug 2018 - Aug 2019, $102,240). This role included oversight of data collection for the Utah School Readiness board in collaboration with Utah State University Center for Persons with Disabilities. The project required recruiting, training and oversight of approximately 10 hourly personnel working at more than 20 community program sites.",
      "Chinese Cultural Adaptation of Parents' Interaction with Children: Checklist of Observations Linked to Outcomes. Hemingway Vitality Grant, Weber State University, Ogden UT. Research, Scholarship and Professional Growth Committee, 2019.",
      "Establishing a Research Assessment Database System for the Melba S. Lehner Children’s School. Melba S. Lehner Endowment, Weber State University, Ogden UT. Child and Family Studies Department, 2017.",
      "Early Childhood Utah Comprehensive System Impact Project. Maternal and Child Health Federal Consolidated Programs, Washington D.C. (Evaluator). Project Director Carolyn Christensen. Bureau of Child Development Early Childhood Utah, Salt Lake City UT. Early Childhood Utah.",
      "Coparenting Skills Online: A Teaching Methods Experiment. Long Term Undergraduate Research Grants (Mentored Student), Weber State University, Ogden UT. Child and Family Studies Department, 2016.",
      "Family Life Education Programs: Using Clinical Trials to Assess Efficacy of Online Community Curriculum. Dee Family Technology Grants, Weber State University, Ogden UT. Child and Family Studies Department, 2016.",
      "Strengthening Early Childhood Teacher Education through Practice-based Coaching. Moyes College of Education Endowment. Weber State University, Ogden UT. Department of Child and Family Studies, 2015.",
      "Strengthening Early Childhood Teacher Education through Practice-based Coaching. Research, Scholarship, and Professional Growth Grants. Weber State University, Ogden UT. Department of Child and Family Studies, 2015.",
      "Delivering Professional Development to Early Educators through Targeted “Playshops”, Sorenson Legacy Foundation, Salt Lake City, Utah, 2014, Utah Association for the Education of Young Children.",
      "Dads’ Parents Interactions with Children-Checklist of Observations Linked to Outcomes (PICCOLO-D). Head Start Graduate Student Research Grant Administration on Children, Youth and Families, Washington, D.C.,Utah State University 2009.",
      "Child Care Acess Means Parents in School (CCAMPIS), Office of Postsecondary Education, Weber State University, 2001."
    ],
    "articles": [
      "Anderson, S., StGeorge, J., & Roggman, L. A. (2019 online). Measuring Rough and Tumble Play: Tools for Practice and Research. Child & Youth Care Forum, (online), 1-27, doi 10.1007/s10566-019-09513-9",
      "Anderson, S., Qiu, W., & Wheeler, S. (2017, online). The Quality of Father Rough and\nTumble Play and Toddlers’ Aggressive Behavior in China. Infant Mental Health Journal, 38, (6), 726-742. doi:10.1002/imhj.21675",
      "Anderson, S., Roggman, L.A., Cook, G., & Innocenti, M.S. (2017). Measuring father involvement. In C. Mazza & A. Perry (Eds.), Fatherhood in America: Social Work perspectives on a changing society, Springfield, IL: Charles C. Thomas.",
      "Anderson, S., Aller, T. B., Piercy, K. W., & Roggman, L. A. (2015). ‘Helping us find our own selves’: exploring father-role construction and early childhood programme engagement. Early Child Development and Care, 185(3), 360-376. doi: 10.1080/03004430.2014.924112",
      "Anderson, S., Roggman, L. A., Innocenti, M., Cook, G. A. (2013). Dads’ Interactions with Children: Checklist of Observations Linked to Outcomes (PICCOLO-D). Infant Mental Health Journal, 34  (4), 339-351.",
      "Roggman, L. A., Cook, G. A., Innocenti, M. S., Jump Norman, V., Christiansen, K. & Anderson,\nS. (2013). Parenting Interactions with Children: Checklist of Observations Linked to Outcomes: User’s Guide. Baltimore, MD: Paul H. Brooks Publishing."
    ],
    "presentations": []
  },
  {
    "name": "Carrie Ota, PH.D.",
    "headshotFile": "https://www.weber.edu/wsuimages/chfam/chfdepart/images/faculty/CarrieOtacrop.jpg",
    "vitae": "",
    "webpage": "/individual_pages/ota.html",
    "office": "ED Building 244",
    "email": "carrieota@weber.edu",
    "phone": 3852440098,
    "education": [],
    "courses": [
      {
        "identifier": "CHF 1500",
        "name": "Human Development",
        "description": "A survey course which addresses the developmental aspects of individuals across the lifespan. Course content encompasses the study of biological, cognitive, social, and emotional developmental changes of the healthy individual in the context of the family and society. It emphasizes and demonstrates the vital connections between theory, research, and application."
      },
      {
        "identifier": "ECED 2620",
        "name": "Planning Creative Experiences for Young Children",
        "description": "Development of attitudes, materials, and skills needed to plan and teach age, individually, and culturally appropriate curriculum for young children. Students complete a minimum of 24 hours practicum arranged by the instructor."
      },
      {
        "identifier": "ECED 4710",
        "name": "Advanced Guidance and Planning for Early Childhood Education",
        "description": "A synthesis of guidance and planning with an emphasis on assessment, appropriate objectives and strategies for individual and specific groups of children. Requires both lecture and lab time."
      }
    ],
    "awards": [
      "Crystal Crest Master Teacher Award Finalist",
      "Distinguished Teaching Award from the Early EdU Alliance",
      "NAECTE Outstanding Early Childhood Teacher Educator Award"
    ],
    "articles": [
      "DiCarlo, C.F., Ota, C.L., Bankston, J., & Dahl, A. (2022). Child-Sustained Attention in Two-Year-Olds. Early Childhood Education Journal, DOI: 0.1007/s10643-022-01362-x",
      "Baumgartner, J., Ota, C.L., DiCarlo, C., Bauer, R. & Carson, R. (2021). Childcare Teachers' Stress, Classroom Behaviors, and Afterhours Professionalism Activities. Child Care and Practice. 10.1080/13575279.2021.1962247",
      "DiCarlo C. F., Baumgartner, J. J., Ota, C.L., Deris, A.R. & Brooksher, M.H. (2020) Recommended practice in whole-group instruction: Increasing child attention. Child & Family Behavior Therapy, DOI: 10.1080/00168890.2020.1848407",
      "DiCarlo, C.F, Ota, C.L., & Deris, A. (2020). An ecobehavioral analysis of social behavior across learning contexts in kindergarten.  Early Childhood Education Journal, DOI 10.1007/s10643-020-01103-y"
    ]
  },
  {
    "name": "Daniel S. Hubler, Ph.D.",
    "headshotFile": "https://apps.weber.edu/wsuimages/chfam/chfdepart/Daniel%20Hubler-4615-2%20(1).jpg",
    "vitae": "",
    "webpage": "/individual_pages/hubler.html",
    "office": "ED Building 229",
    "email": "danielhubler@weber.edu",
    "phone": 8014367243,
    "education": [
      "Ph.D., Human Environmental Sciences, Oklahoma State University",
      "M.S., Human Development and Family Science, Oklahoma State University",
      "B.S., Family Studies, Weber State University"
    ],
    "courses": [
      {
        "identifier": "FAM 2100",
        "name": "Family Resource Management",
        "description": ""
      },
      {
        "identifier": "CHF 2400",
        "name": "Family Relations",
        "description": ""
      },
      {
        "identifier": "FAM 3150",
        "name": "Consumer Rights and Responsbilities",
        "description": ""
      },
      {
        "identifier": "FAM 4650",
        "name": "Family Life Education Methods",
        "description": ""
      },
      {
        "identifier": "FAM 3660",
        "name": "LGBTQ Families",
        "description": ""
      },
      {
        "identifier": "MED 6800",
        "name": "Advanced Web-based Methods for Evaluation, Research, and Practice",
        "description": ""
      }
    ],
    "awards": [],
    "articles": [
      "Burr, B. K., Hubler, D. S., Larzelere, R. E., & Gardner, B. C. (2013). Applying the actor-partner interdependence model to micro-level analyses of marital partner affect during couple conversations. Marriage and Family Review, 49, 284-308.",
      "Schwerdtfeger, K. L., Todd, J., Oliver, M., & Hubler, D (2013). Trying v. Not Trying: A qualitative exploration of pregnancy intentions, the transition to parenthood, and the couple relationship.Journal of Couple and Relationship Therapy. 12, 113-134."
    ]
  },
  {
    "name": "Alex Collopy, Ph.D.",
    "headshotFile": "https://apps.weber.edu/wsuimages/chfam/chfdepart/images/Alex%20Collopy-11572-2.JPEG",
    "vitae": "",
    "webpage": "/individual_pages/collopy.html",
    "office": "ED Building 208",
    "email": "alexcollopy@weber.edu",
    "phone": 8016489002,
    "education": [],
    "courses": [
      {
        "identifier": "ECED 2500",
        "name": "Development of the Child",
        "description": "This course examines contemporary theory and research of growth and development from conception through childhood, studied in the context of family, gender, culture, language, disability, socioeconomics, diversity, and society."
      },
      {
        "identifier": "ECED 4620/GSE 6260",
        "name": "Inclusive Early Childhood Curriculum",
        "description": "Critical issues, theories, research, and practice in curriculum for inclusive early childhood education. The goal of this course is to assist students in planning, implementing, and evaluating curriculum that is accessible and culturally sustaining for diverse children and families. Students will be challenged to develop and articulate their own philosophies on what should be taught to young children and why."
      },
      {
        "identifier": "ECED 4130",
        "name": "Language Development and Emergent Literacy in Early Childhood",
        "description": "This course explores current theory, research, and evidence based practices for promoting early language and emergent literacy development (birth 8 years) in home, child care, prekindergarten, and primary education environments through collaborative practices between early childhood professionals and parents."
      },
      {
        "identifier": "GSE 6220",
        "name": "Understanding Children Beyond Behaviors",
        "description": "This course provides a foundation for understanding and engaging with children’s behavior and needs in school, home, and community settings, toward new and relational understandings of children, child development, and difference. While studying theories and research from fields of neuroscience, psychoanalysis, Disability Studies in Education, and critical perspectives in early childhood education, students will practice therapeutic techniques for observation and engagement with children and families."
      },
      {
        "identifier": "ECED 4820/GSE 6820",
        "name": "Child Observation Seminar",
        "description": "The Child Observation Seminar is a small group reflective practice seminar. Students meet weekly to view and discuss video clips from work with young children in school, home, or community settings. Groups are facilitated to support early childhood professionals in feeling and awareness in their subjective emotional present, toward new experiences of themselves with children, families, and fellow early childhood professionals that may transform their work."
      }
    ],
    "awards": [],
    "articles": []
  }
]
